const entries = [
    "星宮いちご",
    "霧矢あおい",
    "紫吹蘭",
    "神崎美月",
    "有栖川おとめ",
    "藤堂ユリカ",
    "一ノ瀬かえで",
    "北大路さくら",
    "三ノ輪ヒカリ",
    "神谷しおん",
    "音城セイラ",
    "冴草きい",
    "風沢そら",
    "夏樹みくる",
    "音城ノエル",
    "大空あかり",
    "氷上スミレ",
    "新条ひなき",
    "紅林珠璃",
    "服部ユウ",
    "天羽まどか",
    "黒沢凛",
    "姫里マリア",
    "藤原みやび",
    "栗栖ここね",
    "堂島ニーナ",
    "大地のの",
    "白樺リサ",
    "星宮りんご",
    "光石織姫",
    "星宮らいち",
    "ジョニー別府",
    "涼川直人",
    "瀬名翼",
    "四ツ葉春",
];

function render() {
    entries.forEach(e => {
        let elm = '<li class="mdl-list__item"><span class="mdl-list__item-primary-content"><a href="/entry/'+e+'">'+e+'</a></span></li>';
        $("#entries").append(elm);
    });
}

render();
